{"backend": "tensorflow", "keras_version": "2.2.2", "class_name": "Model", "config": {"layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 3], "sparse": false, "name": "input_1"}}, {"name": "block1_conv1", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"use_bias": true, "activation": "relu", "dilation_rate": [1, 1], "filters": 64, "kernel_regularizer": null, "trainable": false, "strides": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block1_conv1", "kernel_constraint": null, "padding": "same", "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [3, 3]}}, {"name": "block1_conv2", "class_name": "Conv2D", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "config": {"use_bias": true, "activation": "relu", "dilation_rate": [1, 1], "filters": 64, "kernel_regularizer": null, "trainable": false, "strides": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block1_conv2", "kernel_constraint": null, "padding": "same", "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [3, 3]}}, {"name": "block1_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "config": {"trainable": false, "pool_size": [2, 2], "name": "block1_pool", "strides": [2, 2], "padding": "valid", "data_format": "channels_last"}}, {"name": "block2_conv1", "class_name": "Conv2D", "inbound_nodes": [[["block1_pool", 0, 0, {}]]], "config": {"use_bias": true, "activation": "relu", "dilation_rate": [1, 1], "filters": 128, "kernel_regularizer": null, "trainable": false, "strides": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block2_conv1", "kernel_constraint": null, "padding": "same", "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [3, 3]}}, {"name": "block2_conv2", "class_name": "Conv2D", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "config": {"use_bias": true, "activation": "relu", "dilation_rate": [1, 1], "filters": 128, "kernel_regularizer": null, "trainable": false, "strides": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block2_conv2", "kernel_constraint": null, "padding": "same", "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [3, 3]}}, {"name": "block2_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "config": {"trainable": false, "pool_size": [2, 2], "name": "block2_pool", "strides": [2, 2], "padding": "valid", "data_format": "channels_last"}}, {"name": "block3_conv1", "class_name": "Conv2D", "inbound_nodes": [[["block2_pool", 0, 0, {}]]], "config": {"use_bias": true, "activation": "relu", "dilation_rate": [1, 1], "filters": 256, "kernel_regularizer": null, "trainable": false, "strides": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block3_conv1", "kernel_constraint": null, "padding": "same", "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [3, 3]}}, {"name": "block3_conv2", "class_name": "Conv2D", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "config": {"use_bias": true, "activation": "relu", "dilation_rate": [1, 1], "filters": 256, "kernel_regularizer": null, "trainable": false, "strides": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block3_conv2", "kernel_constraint": null, "padding": "same", "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [3, 3]}}, {"name": "block3_conv3", "class_name": "Conv2D", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "config": {"use_bias": true, "activation": "relu", "dilation_rate": [1, 1], "filters": 256, "kernel_regularizer": null, "trainable": false, "strides": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block3_conv3", "kernel_constraint": null, "padding": "same", "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [3, 3]}}, {"name": "block3_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]], "config": {"trainable": false, "pool_size": [2, 2], "name": "block3_pool", "strides": [2, 2], "padding": "valid", "data_format": "channels_last"}}, {"name": "block4_conv1", "class_name": "Conv2D", "inbound_nodes": [[["block3_pool", 0, 0, {}]]], "config": {"use_bias": true, "activation": "relu", "dilation_rate": [1, 1], "filters": 512, "kernel_regularizer": null, "trainable": false, "strides": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block4_conv1", "kernel_constraint": null, "padding": "same", "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [3, 3]}}, {"name": "block4_conv2", "class_name": "Conv2D", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "config": {"use_bias": true, "activation": "relu", "dilation_rate": [1, 1], "filters": 512, "kernel_regularizer": null, "trainable": false, "strides": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block4_conv2", "kernel_constraint": null, "padding": "same", "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [3, 3]}}, {"name": "block4_conv3", "class_name": "Conv2D", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "config": {"use_bias": true, "activation": "relu", "dilation_rate": [1, 1], "filters": 512, "kernel_regularizer": null, "trainable": false, "strides": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block4_conv3", "kernel_constraint": null, "padding": "same", "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [3, 3]}}, {"name": "block4_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]], "config": {"trainable": false, "pool_size": [2, 2], "name": "block4_pool", "strides": [2, 2], "padding": "valid", "data_format": "channels_last"}}, {"name": "block5_conv1", "class_name": "Conv2D", "inbound_nodes": [[["block4_pool", 0, 0, {}]]], "config": {"use_bias": true, "activation": "relu", "dilation_rate": [1, 1], "filters": 512, "kernel_regularizer": null, "trainable": false, "strides": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block5_conv1", "kernel_constraint": null, "padding": "same", "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [3, 3]}}, {"name": "block5_conv2", "class_name": "Conv2D", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]], "config": {"use_bias": true, "activation": "relu", "dilation_rate": [1, 1], "filters": 512, "kernel_regularizer": null, "trainable": false, "strides": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block5_conv2", "kernel_constraint": null, "padding": "same", "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [3, 3]}}, {"name": "block5_conv3", "class_name": "Conv2D", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]], "config": {"use_bias": true, "activation": "relu", "dilation_rate": [1, 1], "filters": 512, "kernel_regularizer": null, "trainable": false, "strides": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "block5_conv3", "kernel_constraint": null, "padding": "same", "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [3, 3]}}, {"name": "block5_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]], "config": {"trainable": false, "pool_size": [2, 2], "name": "block5_pool", "strides": [2, 2], "padding": "valid", "data_format": "channels_last"}}], "input_layers": [["input_1", 0, 0]], "output_layers": [["block5_pool", 0, 0]], "name": "vgg16"}}